doc/td/td_polymorphisme.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Polymorphisme</title>
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" href="../stylesheets/styles.css">
                 <link rel="stylesheet" href="../stylesheets/org-pygments.css">
</head>
<body>
<div id="preamble" class="status">
</a><a href="td_pointeur_fonction.html">Compilation, pointeur & références </a><a href="td_specificite_c++.html">Spécificités du C++ </a><a href="td_classes.html">Classes en C++ </a><a href="td_classe_complexe.html">Fraction de nombres complexes </a><a href="td_nombre_aleatoire.html">Constructeur & destructeurs </a><a href="td_surcharge_operateur.html">Surcharge d'opérateur </a><a href="td_polymorphisme.html">Polymorphisme & classe abstraite </a><a href="td_blackjack.html">Jeu du blackjack </a>
                     <hr/>
                     <a href="../../index.html">Retour menu principal</a>
</div>
<div id="content">
<h1 class="title">Polymorphisme</h1><hr/>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">Classe <code>Employe</code></h2>
<div class="outline-text-2" id="text-orgheadline1">
<p>
Créer une classe abstraite <code>Employe</code> contenant :
</p>

<ul class="org-ul">
<li>un nom de type <code>string</code> <sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>,</li>
<li>un prénom de type <code>string</code>,</li>
<li>un entier correspondant à l&rsquo;âge.</li>
</ul>

<p>
On définira également les méthodes suivantes :
</p>

<ul class="org-ul">
<li>un constructeur,</li>
<li>un destructeur (virtuel),</li>
<li>une méthode purement virtuelle <code>CalculerSalaire</code>,</li>
<li>une méthode virtuelle <code>GetNom</code> qui sera redéfinie dans les classes filles.</li>
</ul>

<p>
Dans le programme principal, créer une instance d&rsquo;<code>Employe</code> puis générer un
tableau de pointeur d&rsquo;<code>Employe</code> appelé <code>Entreprise</code>.
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2">Branche <code>Commercial</code></h2>
<div class="outline-text-2" id="text-orgheadline2">
<p>
Créer une classe <code>Commercial</code> qui hérite d&rsquo;<code>Employe</code>. Cette classe a un membre
de plus qu&rsquo;<code>Employe</code> : un entier <code>ChiffreAffaire</code>. Dans la mesure où elle
n&rsquo;explicite pas la méthode <code>CalculerSalaire</code>, la classe <code>Commercial</code> est
abstraite.
</p>

<p>
Créer une classe <code>Vendeur</code> dérivant de <code>commercial</code> avec :
</p>

<ul class="org-ul">
<li>un constructeur,</li>
<li>un destructeur,</li>
<li>définir le salaire <i>via</i> la méthode virtuelle <code>CalculerSalaire</code>. Par
exemple, une base fixe à 1000 euros + 20% du <code>ChiffreAffaire</code>,</li>
<li>redéfinir <code>GetNom</code> en mettant en en-tête &ldquo;Le vendeur :&rdquo; puis le nom.</li>
</ul>

<p>
Créer une classe <code>Representant</code> héritant de <code>Commercial</code> avec :
</p>

<ul class="org-ul">
<li>un constructeur,</li>
<li>un destructeur,</li>
<li>définir le salaire \emph{via} la méthode virtuelle <code>CalculerSalaire</code>,</li>
<li>redéfinir <code>GetNom</code> en mettant en en-tête &ldquo;Le représentant :&rdquo; puis le nom.</li>
</ul>

<p>
Dans le programme principal, remplir le tableau de pointeur d&rsquo;<code>Employe</code> par
l&rsquo;adresse d&rsquo;un <code>Vendeur</code> et d&rsquo;un <code>Representant</code>.
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Notes : </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
la classe <code>string</code> fait partie de la librairie standard et facilite la
gestion et la manipulation des chaînes de caractères. Pour pouvoir l&rsquo;utiliser,
il conviendra d&rsquo;inclure le fichier d&rsquo;en-tête <code>string</code>.
</p></div></div>


</div>
</div></div>
</body>
</html>
